app/views/distribution_centers/show.html.erb

SELECT "product_distribution_centers".* FROM "product_distribution_centers" WHERE "product_distribution_centers"."distribution_center_id" = $1  [["distribution_center_id", 3]]
---
<h3>Products Stocked</h3>
  <% unless @distribution_center.product_distribution_centers.blank? %>

SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
---
    <% @distribution_center.product_distribution_centers.each do |pdc| %>
      <li><%= "#{Product.find(pdc.product_id).name} - Qty: #{pdc.quantity}"  %></li>

SELECT "products".* FROM "products" WHERE "products"."persona_id" = $1  [["persona_id", 12]]
---

  <%=  select("product", "name", current_persona.products.collect {|p| p.name}, {include_blank: false}) %>