app/views/factories/new.html.erb

SELECT "factories".* FROM "factories" WHERE "factories"."persona_id" = $1  [["persona_id", 4]]
---
  <ul>
    <% current_persona.factories.each do |factory| %>