app/views/personas/new.html.erb

<%= form_tag '/personas_sessions', method: :post do %>
<%=  select("persona", "name", User.find(current_user.id).personas.collect {|p| p.name}, {include_blank: true}) %>
---
SELECT  "personas".* FROM "personas" WHERE "personas"."user_id" = $1 ORDER BY "personas"."id" ASC LIMIT $2  [["user_id", 4], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]