app/views/personas/show.html.erb

SELECT "products".* FROM "products" WHERE "products"."persona_id" = $1  [["persona_id", 1]]
SELECT COUNT(*) FROM "products" WHERE "products"."persona_id" = $1  [["persona_id", 1]]
---
<h3>Products</h3>
  <% if current_persona.products.count > 0 %>

SELECT "factories".* FROM "factories" WHERE "factories"."persona_id" = $1  [["persona_id", 4]]
---
    <br>
    <%=  select("order", "factory", current_persona.factories.collect {|f| f.name if f.availability}.compact, {include_blank: false}) %>

SELECT  "distribution_centers".* FROM "distribution_centers" WHERE "distribution_centers"."persona_id" = $1 ORDER BY "distribution_centers"."id" ASC LIMIT $2  [["persona_id", 12], ["LIMIT", 1]]
---

  <% unless current_persona.distribution_centers.blank? %>

SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
---
        <% dc.product_distribution_centers.each do |pdc| %>
          <li><%= "#{Product.find(pdc.product_id).name} - Qty: #{pdc.quantity}"  %></li>

SELECT "products".* FROM "products" WHERE "products"."persona_id" = $1 AND "products"."active" = $2  [["persona_id", 12], ["active", true]]
SELECT "orders".* FROM "orders" WHERE "orders"."product_id" = $1 AND "orders"."complete" = $2  [["product_id", 7], ["complete", false]]
---

  <% current_persona.products.where(active: true).each do |product_production| %>

    <% product_production.orders.where(complete: false).each do |order| %>