app/controllers/distribution_centers_controller.rb

  def create
    @distribution_center = DistributionCenter.new(dc_params)
    @distribution_center.persona_id = current_persona.id
    @distribution_center.capacity = 100000
    @distribution_center.save
---
INSERT INTO "distribution_centers" ("name", "capacity", "persona_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Warehouse"], ["capacity", 100000], ["persona_id", 12], ["created_at", 2017-01-09 01:24:39 UTC], ["updated_at", 2017-01-09 01:24:39 UTC]]

  def stock_product
    @dc = DistributionCenter.find(params[:id])
    @pdc = ProductDistributionCenter.new
    @pdc.distribution_center_id = @dc.id
    @pdc.product_id = Product.find_by(name: params[:product][:name]).id
    @pdc.quantity = 0
    @pdc.save
---
SELECT  "distribution_centers".* FROM "distribution_centers" WHERE "distribution_centers"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT  "products".* FROM "products" WHERE "products"."name" = $1 LIMIT $2  [["name", "Jiggy"], ["LIMIT", 1]]
INSERT INTO "product_distribution_centers" ("distribution_center_id", "product_id", "quantity", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["distribution_center_id", 3], ["product_id", 7], ["quantity", 0], ["created_at", 2017-01-09 03:35:04 UTC], ["updated_at", 2017-01-09 03:35:04 UTC]]

  def show
    @distribution_center = DistributionCenter.find(params[:id])
---
SELECT "product_distribution_centers".* FROM "product_distribution_centers" WHERE "product_distribution_centers"."distribution_center_id" = $1  [["distribution_center_id", 3]]