app/controllers/factories_controller.rb

  def create
    @persona = Persona.find(current_persona.id)
    @factory = Factory.find(params[:factory])
    @factory.availability = true
    @factory.save
    @persona.money -= @factory.cost
    @persona.save
---
SELECT  "personas".* FROM "personas" WHERE "personas"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
SELECT  "factories".* FROM "factories" WHERE "factories"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
UPDATE "factories" SET "availability" = $1, "updated_at" = $2 WHERE "factories"."id" = $3  [["availability", true], ["updated_at", 2017-01-08 17:27:51 UTC], ["id", 8]]
UPDATE "personas" SET "money" = $1, "updated_at" = $2 WHERE "personas"."id" = $3  [["money", 9900], ["updated_at", 2017-01-08 17:30:07 UTC], ["id", 12]]

  def show
    @factory = Factory.find(params[:id])
---
SELECT  "factories".* FROM "factories" WHERE "factories"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]