app/controllers/game_controller.rb

  def advance_time

    # elapsed_time = params[:time]
    elapsed_time = 30

    @persona = Persona.find(current_persona.id)
    @persona.game_time += elapsed_time
    @persona.save

    # sell units every 30 days
    products = @persona.products

    # find product
    products.each do |product|
      demand = product.demand

      # remove from DC
      dc = ProductDistributionCenter.find_by(product_id: product.id)
      dc.quantity -= demand
      dc.save
---
SELECT  "personas".* FROM "personas" WHERE "personas"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
UPDATE "personas" SET "game_time" = $1, "updated_at" = $2 WHERE "personas"."id" = $3  [["game_time", 31], ["updated_at", 2017-01-12 03:37:51 UTC], ["id", 12]]
SELECT "products".* FROM "products" WHERE "products"."persona_id" = $1  [["persona_id", 12]]
SELECT  "product_distribution_centers".* FROM "product_distribution_centers" WHERE "product_distribution_centers"."product_id" = $1 ORDER BY "product_distribution_centers"."id" ASC LIMIT $2  [["product_id", 7], ["LIMIT", 1]]
UPDATE "product_distribution_centers" SET "quantity" = $1, "updated_at" = $2 WHERE "product_distribution_centers"."id" = $3  [["quantity", -100], ["updated_at", 2017-01-12 04:44:24 UTC], ["id", 2]]
UPDATE "products" SET "demand" = $1, "updated_at" = $2 WHERE "products"."id" = $3  [["demand", 83], ["updated_at", 2017-01-12 04:44:24 UTC], ["id", 7]]


    #duplicate call to update info (might be pointless)
    @persona = Persona.find(current_persona.id)
    products = @persona.products.where(active: true)
    products.each do |product|

      # find orders that have elapsed past 60 days and are not yet completed
      product.orders.where(complete: false).each do |order|
---
SELECT "products".* FROM "products" WHERE "products"."persona_id" = $1 AND "products"."active" = $2  [["persona_id", 12], ["active", true]]
SELECT "orders".* FROM "orders" WHERE "orders"."product_id" = $1 AND "orders"."complete" = $2  [["product_id", 7], ["complete", false]]


          # complete them
          order.complete = true
          order.save

          # transfer them to DC
          qty = order.quantity
          dc = order.product.product_distribution_centers.first
---
UPDATE "orders" SET "complete" = $1, "updated_at" = $2 WHERE "orders"."id" = $3  [["complete", true], ["updated_at", 2017-01-12 04:44:24 UTC], ["id", 2]]
SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]