app/controllers/orders_controller.rb

  def create

    @order = Order.new
    @order.product_id = current_persona.products.where(name: params[:order][:name]).first.id
    @order.quantity = params[:order][:quantity]
    @order.factory_id = current_persona.factories.where(name: params[:order][:factory]).first.id
    @order.order_date = current_persona.game_time
    @order.save
---
SELECT  "products".* FROM "products" WHERE "products"."persona_id" = $1 AND "products"."name" = $2 ORDER BY "products"."id" ASC LIMIT $3  [["persona_id", 12], ["name", "Jiggy"], ["LIMIT", 1]]
SELECT  "factories".* FROM "factories" WHERE "factories"."persona_id" = $1 AND "factories"."name" = $2 ORDER BY "factories"."id" ASC LIMIT $3  [["persona_id", 12], ["name", "JYEF"], ["LIMIT", 1]]
SELECT "factories".* FROM "factories" WHERE "factories"."persona_id" = $1  [["persona_id", 12]]
INSERT INTO "orders" ("product_id", "factory_id", "order_date", "quantity", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["product_id", 7], ["factory_id", 12], ["order_date", 91], ["quantity", 80], ["created_at", 2017-01-12 05:01:34 UTC], ["updated_at", 2017-01-12 05:01:34 UTC]]