app/controllers/personas_controller.rb

SELECT  "personas".* FROM "personas" WHERE "personas"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    if session[:persona_id].blank?
      redirect_to new_persona_path and return
    end
    @persona = Persona.find(session[:persona_id])