app/controllers/personas_controller.rb

  def create
    #Logged in check
    unless session[:persona_id].blank?
      @persona = Persona.find(session[:persona_id])
      redirect_to @persona and return
    end

    if !!params[:persona_login]
      ##Attempt login
      @persona = current_user.personas.find {|p| p.name = params[:persona_login][:name] }

    else
      ##Attempt Registration
      @persona = Persona.new(persona_params)
        @persona.money = 20000
        @persona.user_id = current_user.id
        @persona.save
---
SELECT  "personas".* FROM "personas" WHERE "personas"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
SELECT  "personas".* FROM "personas" WHERE "personas"."name" = $1 LIMIT $2  [["name", "Eric"], ["LIMIT", 1]]
INSERT INTO "personas" ("name", "money", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Jim"], ["money", 10000], ["user_id", 1], ["created_at", 2017-01-06 05:41:43 UTC], ["updated_at", 2017-01-06 05:41:43 UTC]]

  def destroy
    current_persona.destroy
---
DELETE FROM "personas" WHERE "personas"."id" = $1  [["id", 7]]