app/controllers/personas_sessions_controller.rb

SELECT  "personas".* FROM "personas" WHERE "personas"."name" = $1 LIMIT $2  [["name", "Eric"], ["LIMIT", 1]]
---
  def create

    @persona = current_user.personas.find {|p| p.name == (params[:persona][:name])}