app/controllers/products_controller.rb

  def create
    @product = Product.new(product_params)
    @product.persona_id = session[:persona_id]
    @product.save
---
INSERT INTO "products" ("name", "category", "persona_id", "sell_price", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Mac"], ["category", "Technology"], ["persona_id", 1], ["sell_price", 1000], ["created_at", 2017-01-06 05:18:39 UTC], ["updated_at", 2017-01-06 05:18:39 UTC]]