app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."user_name" = $1 LIMIT $2  [["user_name", "alannaloveeric64"], ["LIMIT", 1]]
---
  def create
    @user = User.find_by(user_name: params[:user_name])